# Реализовать скрипт вычисляющий разность квадрата суммы и суммы квадратов.
# Решим задачу для последовательности первых n натуральных чисел
# 1^2 + 2^2 + ... + 10^2 = 385
# (1 + 2 + ... + 10)^2 = 552 = 3025
#  3025 − 385 = 2640.
n = 10
summ = 0
summ2 = 0
for i in range(1, n + 1):
    summ += i ** 2
    summ2 += i

diff = summ2 ** 2 - summ
print(diff)

# 2 Способ подсчет разность квадрата суммы и суммы квадратов чисел из списка
a = [i for i in range(1, 11)]
# a = [2, 3, 1]
summ = 0
summ2 = 0
for i in a:
    summ += i ** 2
    summ2 += i

diff = summ2 ** 2 - summ
print('Из списка значений', diff)

# Математическое решение формулой
# n*(n+1)*(2*n+1)/6 - сумма квадратов
# (n*(n+1)/2))**2 - сумма первых n чисел в квадрате
print('По формуле', int((n * (n + 1) / 2) ** 2) - n * (n + 1) * (2 * n + 1) / 6)
